{
    "experiences": [
        
        {
            "title": "Internship Coordinator",
            "subtitle": "Tiers Limited",
            "workType": "Job",
            "workDescription": [
                "Managing internship programs and coordinating with interns for project assignments.",
                "Providing mentorship and guidance to ensure successful project outcomes.",
                "Leading new interns, helping them integrate into the team and providing support for their development.",
                "Monitoring intern progress, offering feedback, and conducting performance evaluations.",
                "Collaborating with HR to improve internship processes and recruitment strategies."
            ],
            "dateText": "July/2024 – Present"
        },
        {
            "title": "Associate Software Engineer",
            "subtitle": "Tiers Limited",
            "workType": "Job",
            "workDescription": [
                "Building and maintaining Flutter applications across multiple platforms.",
                "Implementing new features and optimizing performance for scalability.",
                "Delivering high-quality projects within specified timelines, ensuring client satisfaction.",
                "Collaborating closely with design and backend teams to ensure seamless user experience and smooth data integration.",
                "Leading app performance optimization efforts and utilizing best practices for efficient state management using BLoC and GetX.",
                "Continuously improving existing codebases, introducing new features, and maintaining high code quality through reviews and testing."
            ],
            "dateText": "Mar/2024 – Present"
        },
        {
            "title": "Flutter Developer",
            "subtitle": "Tiers Limited",
            "workType": "Internship",
            "workDescription": [
                "Developed cross-platform mobile applications using Flutter.",
                "Integrated Firebase for authentication, real-time data, and cloud storage.",
                "Utilized GetX and Provider for state management.",
                "Followed Clean Architecture principles for scalable app development.",
                "Worked in an agile environment, collaborating with team members to deliver high-quality features."
            ],
            "dateText": "Nov/2023 – Feb/2024"
        },
        {
            "title": "Android Developer (Kotlin)",
            "subtitle": "CodSoft",
            "workType": "Internship",
            "workDescription": [
                "Developed Four Feature-Rich Android apps using Kotlin:- \n, \n\n",
                "Torch Light App, Calculator App, Currency Converter App, Academic System App. (For more details, please refer to the Projects section)",
                "Utilized RoomDatabase and Retrofit for efficient Data Storage and API Integration.",
                "Implemented a Clean and Scalable MVVM Architecture for each App.",
                "Delivered User-Friendly and Responsive Android Applications."
            ],
            "dateText": "Aug/2023 – Sep/2023"
        },
        {
            "title": "Android Developer (Java)",
            "subtitle": "Info Aid Tech",
            "workType": "Internship",
            "workDescription": [
                "Developed Three Android Apps using Java ",
                "Calculator, To-Do List, and Weather App. (For more details, please refer to the Projects section)",
                "Mastered database management and API integration.",
                "Enhanced UI/UX design for better user experiences.",
                "Contributed to agile development in a collaborative environment."
            ],
            "dateText": "May/2023 – July/2023"
        },
        {
            "title": "App Development Core Team Member",
            "subtitle": "Google DSC",
            "workType": "GCU",
            "workDescription": [
                "Contributed to the development of innovative apps for various tech initiatives.",
                "Collaborated with a diverse team of developers to implement user-friendly and functional mobile solutions.",
                "Provided mentorship to junior members and participated in regular brainstorming sessions for app design and development strategies.",
                "Participated in the successful completion of multiple app development projects that aligned with the goals of Google DSC."
            ],
            "dateText": "2023 – Present"
        },
        {
            "title": "Ambassador",
            "subtitle": "Google DSC",
            "workType": "GCU",
            "workDescription": [
                "Tech Engagement: Actively participated in hackathons, workshops, and tech-related activities.",
                "Built a diverse network of tech enthusiasts and professionals.",
                "Gained access to valuable course materials and webinars.",
                "Made valuable connections and expanded my network by engaging with diverse individuals.",
                "Contributed to my ongoing journey of tech excellence."
            ],
            "dateText": "2022 – 2023"
        }
    ]
}
