{
    "experiences": [
        {
          "title": "Associate Software Engineer (Full Stack Flutter)",
          "subtitle": "CBSOL",
          "workType": "Job",
          "workDescription": [
            "Developing cross-platform mobile applications using Flutter with GetX and Riverpod for effective state management.",
            "Following Clean Architecture principles to build scalable and maintainable codebases.",
            "Integrating RESTful APIs and ensuring smooth data flow between frontend and backend systems.",
            "Building and maintaining backend services using Node.js, Express.js, and MongoDB for robust data handling.",
            "Collaborating with UI/UX designers, QA engineers, and fellow developers to deliver high-quality features on time.",
            "Actively contributing to code reviews, performance optimization, and debugging to maintain code quality."
          ],
          "dateText": "Jan/2025 – Present"
        },

        {
          "title": "Associate Software Engineer & Internship Coordinator (Flutter)",
          "subtitle": "Tiers Limited",
          "workType": "Job",
          "workDescription": [
            "Developed and maintained cross-platform mobile applications using Flutter for Android and iOS platforms.",
            "Integrated Firebase services including authentication, real-time database, Firestore, and cloud storage.",
            "Followed Clean Architecture principles to build scalable, maintainable, and testable codebases.",
            "Utilized state management tools like GetX, and Provider for structured and reactive UI development.",
            "Collaborated closely with backend teams and designers to ensure seamless API integration and smooth user experience.",
            "Led performance optimization efforts, implemented efficient UI rendering and minimized app load times.",
            "Delivered client-focused features on strict timelines while ensuring code quality through regular reviews.",
            "Managed internship programs as Internship Training Coordinator — mentoring interns, assigning projects, and monitoring their growth and performance."
          ],
          "dateText": "Nov/2023 – Dec/2024"
        },
        
        {
          "title": "Mobile App Developer Intern",
          "subtitle": "Interns Pakistan",
          "workType": "Internship",
          "workDescription": [
            "Worked on mobile applications using Flutter with the MVVM architectural pattern.",
            "Integrated Firebase for real-time database operations, authentications and user data management.",
            "Collaborated with the team to implement clean UI and efficient app logic.",
            "Enhanced app functionality and resolved bugs during development and testing phases."
          ],
          "dateText": "Aug/2023 – Oct/2023"
        },
        
        {
            "title": "App Developer",
            "subtitle": "CodSoft",
            "workType": "Internship",
            "workDescription": [
                "Developed Multiple Feature-Rich Android apps using Kotlin:- \n, \n\n",
                "Utilized RoomDatabase and Retrofit for efficient Data Storage and API Integration.",
                "Implemented a Clean and Scalable MVVM Architecture for each App.",
                "Delivered User-Friendly and Responsive Android Applications."
            ],
            "dateText": "July/2023"
        },
        
        {
            "title": "Android Developer (Kotlin)",
            "subtitle": "Info Aid Tech",
            "workType": "Internship",
            "workDescription": [
                "Developed Multiple Android Apps using Kotlin ",
                "Mastered database management and API integration.",
                "Enhanced UI/UX design for better user experiences.",
                "Contributed to agile development in a collaborative environment."
            ],
            "dateText": "May/2023 – June/2023"
        },
        
        {
            "title": "App Development Core Team Member",
            "subtitle": "Google DSC",
            "workType": "GCU",
            "workDescription": [
                "Contributed to the development of innovative apps for various tech initiatives.",
                "Collaborated with a diverse team of developers to implement user-friendly and functional mobile solutions.",
                "Provided mentorship to junior members and participated in regular brainstorming sessions for app design and development strategies.",
                "Participated in the successful completion of multiple app development projects that aligned with the goals of Google DSC."
            ],
            "dateText": "2023 – Present"
        },
        
        {
            "title": "Ambassador",
            "subtitle": "Google DSC",
            "workType": "GCU",
            "workDescription": [
                "Tech Engagement: Actively participated in hackathons, workshops, and tech-related activities.",
                "Built a diverse network of tech enthusiasts and professionals.",
                "Gained access to valuable course materials and webinars.",
                "Made valuable connections and expanded my network by engaging with diverse individuals.",
                "Contributed to my ongoing journey of tech excellence."
            ],
            "dateText": "2022 – 2023"
        }
    ]
}
